Token = '-'
cities = {
    'Тирасполь': {'тирасполь', 'тирас'},
    'Бендеры': {'бендеры'},
    'Рыбница': {'рыбница'},
    'Дубоссары': {'дубоссары'},
    'Каменка': {'каменка'},
    'Днестровск': {'днестровск'},
    'Григориополь': {'григориополь'},
}
schools = {
    'Тирасполь': {
        'МОУ ТГМГ': ['моутгмг','тгмг','тгмг6','6',],
        'МОУ ТОТЛ': ['моутотл', 'моутотл№1', 'тотл', 'тотл№1',],
        'МОУ ТСШ № 3': ['моутсш3', 'тсш3','3',],
        'МОУ ТСШ № 4': ['моутсш4', 'тсш4','4',],
        'МОУ ТСШ № 5': ['моутсш5', 'тсш5','5',],
        'МОУ ТСШ № 7': ['моутсш7', 'тсш7','7',],
        'МОУ ТСШ № 8': ['моутсш8', 'тсш8','8',],
        'МОУ ТСШ № 9': ['моутсш9', 'тсш9','9',],
        'МОУ ТСШ № 10': ['моутсш10', 'тсш10','10',],
        'МОУ ТСШ № 11': ['моутсш11', 'тсш11','11',],
        'МОУ ТСШК № 12': ['моутсшк12', 'тсшк12','моутсш12','тсш12','12',],
        'МОУ ТСШ № 14': ['моутсш14', 'тсш14','14',],
        'МОУ ТСШ № 15': ['моутсш15', 'тсш15','15',],
        'МОУ ТСШ № 16': ['моутсш16', 'тсш16','16',],
        'МОУ ТСШ № 17': ['моутсш17', 'тсш17','17',],
        'МОУ ТСШГК № 18': ['моутсшгк18', 'тсшгк18','моутсш18','тсш18','18',],
    },
    'Бендеры': {
        'МОУ БСОШ № 2': ['моубсош2', 'бсош2','2',],
        'МОУ БСОШ № 18': ['моубсош18', 'бсош18','18',],
    },
    'Рыбница': {},
    'Дубоссары': {
    'МОУ Дубоссарская гимназия №1': ['моугимназия1','гимназия1','дубоссарскаягимназия1',],
    'МОУ РСОШ № 2': ['моурсош2','рсош2','школа2','2',],
    'МОУ ДРСОШ № 4': ['моудрсош4','школа4','дрсош4','4',],
    'МОУ СОРМШ № 7': ['моусормш7','сормш7','7',],
    },
    'Каменка': {},
    'Днестровск': {
        'МОУ ДнСШ № 1': ['моуднсш1', 'днсш1', '1','моудсш1', 'дсш1'],
        'МОУ ДнСШ № 2': ['моуднсш2', 'днсш2', '2','моудсш2', 'дсш2',],
    },
    'Григориополь': {},
}
adminList=['1037004258']